Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K43A.tmx
Source language: en_us
Languages: zh_cn

source: Encounters with Unexpected Animals
zh_cn: 与意想不到的动物相遇

source: Lambright had surprised everyone by offering to drive his son's girlfriend home.
zh_cn: 兰布赖特开车送他儿子的女友回家，这让大家都感到惊讶。

source: The girl was three months shy of seventeen, two years older than Robbie.
zh_cn: 女孩还有三个月就十七岁了，比罗比大两岁。

source: She'd been held back in school.
zh_cn: 她在学校留级了。

source: Her driver's license was currently suspended.
zh_cn: 她的驾照被暂时吊销了。

source: She had a reputation, a body, and a bar code tattooed on the back of her neck.
zh_cn: 她脖子后面纹了个词‘名声’、一个人体和一个条形码。

source: Lambright sometimes glimpsed it when her green hair was ponytailed.
zh_cn: 在她绿色的头发梳成马尾时，兰布赖特偶尔看见过这个纹身。

source: She'd come over for supper this evening, and though she volunteered to help Robbie and his mother with the dishes, Lambright had said he'd best deliver her home, it being a school night.
zh_cn: 她今晚过来吃晚饭，虽然她主动要求帮罗比和他母亲洗盘子，兰布赖特说还是最好送她回家，因为明天还要上学。

source: He knew this pleased his wife and Robbie, the notion of him giving the girl another chance.
zh_cn: 他知道这让他妻子和罗比很高兴，觉得他打算再给女孩一次机会。

source: Driving, Lambright thought the moon looked like a fingerprint of chalk.
zh_cn: 开车的时候，兰布赖特想着月亮看起来像一个粉笔印的手指印。

source: They headed south on Airline Road.
zh_cn: 他们沿着航空路向南开去。

source: A couple of miles and he'd turn right on Saratoga, then left onto Everhart, and eventually they'd enter Kings Crossing, the subdivision with pools and sprinkler systems.
zh_cn: 开了几英里，他应该在萨拉托加右拐，然后再左拐到埃弗哈特，最后他们应该进入国王十字街区，那个有水池和自动灭火系统的住宅区。

source: At supper, Robbie and the girl had told, in tandem, a story about playing hide-and-seek on the abandoned country club golf course.
zh_cn: 晚饭时，罗比和女孩共同讲了一个在废弃的乡村俱乐部高尔夫球场上捉迷藏的故事。

source: Hide-and-seek, Lambright thought, is that what y'all call it now?
zh_cn: 捉迷藏，兰布赖特想，你们现在都这么称呼？

source: Then they started talking about wildlife.
zh_cn: 然后他们开始谈论野生动物。

source: The girl had once seen a blue-and-gold macaw riding on the headrest of a man's passenger seat, and another time, in a pasture in the Rio Grande Valley, she'd spotted zebras grazing among cattle.
zh_cn: 女孩曾经见过一只蓝黄金刚鹦鹉在一个男人副驾驶位的头靠部分上；另一次，在里奥格兰德河谷的一片草地上，她看到斑马在牛群中吃草。

source: Robbie's mother recalled finding goats in the tops of peach trees in her youth.
zh_cn: 罗比的母亲回想起在她年轻时看到过山羊在桃树顶上。

source: Robbie told the story of visiting the strange neighborhood in San Antonio where the muster of peacocks lived, and it led the girl to confess her desire to get a fan of peacock feathers tattooed on her lower back.
zh_cn: 罗比讲了游玩圣安东尼奥那个孔雀群生活的奇怪地区的故事，这让女孩讲了想在腰背部纹上一把孔雀羽毛扇的愿望。

source: She also wanted a tattoo of a busted magnifying glass hovering over the words FIX ME.
zh_cn: 她还想纹上一个破裂的放大镜悬浮在‘治愈我’几个字上方。

source: Lambright couldn't figure what she saw in his son. Until the girl started visiting, Robbie had superhero posters on his walls and a fleet of model airplanes suspended from the ceiling with fishing wire.
zh_cn: 在女孩开始来拜访前，兰布赖特想不出她从他儿子身上看到了什么，罗比墙上贴着超级英雄的海报，天花板上用钓鱼线悬挂着一个舰队的飞机模型。

source: Lambright had actually long been skeptical of the boy's room, worrying it looked too childish, worrying it confirmed what might be called "softness" of character.
zh_cn: 实际上兰布赖特很长时间一来一直对男孩的房间心存疑虑，担心它看上去太孩子气，担心这证实他性格中存在可能叫做‘软弱’的东西。

source: But now the walls were stripped and all that remained of the fighter fleet was the fishing-wire stubble on the ceiling.
zh_cn: 但现在墙上都撕光了，那些战舰也只剩下天花板上的钓鱼线的头了。

source: Two weeks ago, one of his wife's necklaces disappeared.
zh_cn: 两星期前，他妻子的一条项链不见了。

source: Last week, a bottle of her nerve pills.
zh_cn: 上个星期，她的一瓶神经药丸也不见了。

source: Then, over the weekend, he'd caught Robbie and the girl with a flask of whiskey in the backyard.
zh_cn: 然后，周末，他在后院撞见罗比和拿着一瓶威士忌的女孩。

source: She'd come to supper tonight to make amends.
zh_cn: 她今晚来吃晚饭以作补偿。

source: Traffic was light.
zh_cn: 路上车不多。

source: When he stopped at the intersection of Airline and Saratoga, the only headlights he saw were far off, like buoys in the bay.
zh_cn: 当他在航空路和萨拉托加的交叉口停下时，他看见的唯一的汽车前灯离得很远，像海湾的浮标。

source: The turn signal dinged. He debated, then clicked it off.
zh_cn: 方向灯打开了，他思考着，然后啪嗒一声又关掉了。

source: He accelerated straight across Saratoga.
zh_cn: 他加速直接驶过了萨拉托加。

source: "We were supposed to turn - "
zh_cn: “我们应该转——”

source: "Scenic route," he said. "We'll visit a little."
zh_cn: “这条路很好，”他说，“我们仔细看看。”

source: But they didn't.
zh_cn: 但他们没有。

source: There was only the low hum of the tires on the road, the noise of the truck pushing against the wind.
zh_cn: 只有轮胎碾在路上的低沉的沙沙声，和卡车与风摩擦的声音。

source: Lambright hadn't contributed anything to the animal discussion earlier, but now he considered mentioning what he'd read a while back, how bald-eagle nests are often girded with cat collars, strung with the little bells and tags of lost pets.
zh_cn: 兰布赖特在早前的动物谈论中没有发表任何意见，但现在他考虑谈起他前阵子读过的：秃头鹰的巢为什么经常围着猫的项圈，上面还系着小铃铛和走失宠物的标签。

source: He stayed quiet, though.
zh_cn: 但是他没说话。

source: They were out near the horse stables now.
zh_cn: 他们现在离马棚不远了。

source: The air smelled of alfalfa and manure.
zh_cn: 空气中散发着紫花苜蓿和肥料的气味。

source: The streetlights had fallen away.
zh_cn: 街灯已经远了。

source: The girl said, "I didn't know you could get to Kings Crossing like this."
zh_cn: 女孩说：“我不知道你这样还能到国王十字街区。”

source: They crossed the narrow bridge over Oso Creek, then came into a clearing, a swath of clay and patchy brush, gnarled mesquite trees.
zh_cn: 他们穿过奥索河上狭窄的桥，然后开到一块空地上，那是一条泥土路，点缀着零星的小树丛，树丛里是多节的牡豆树。

source: He pulled onto the road's shoulder.
zh_cn: 他停在路边。

source: Caliche pinged against the truck's chassis.
zh_cn: 硬质的地表砰砰地碰撞着卡车的底盘。

source: He doused his headlights, and the scrub around them silvered, turned to moonscape.
zh_cn: 他关了前灯，他们周围的灌木丛泛着银光，像是月球上的景色。

source: They were outside the city limits, miles from where the girl lived.
zh_cn: 他们在城市范围之外，离女孩住的地方有几英里。

source: He killed the engine.
zh_cn: 他关掉引擎。

source: "I know you have doubts about me.
zh_cn: “我知道你对我有怀疑。

source: I know I'm not - "
zh_cn: 我知道我不是——”

source: "Cut him loose," Lambright said.
zh_cn: “和他断绝关系，”兰布赖特说。

source: "Do what?"
zh_cn: “做什么？”

source: "Give it a week, then tell him you've got someone else."
zh_cn: “过个一星期，然后告诉他你有别人了。”

source: Her eyes scanned the night through the windshield.
zh_cn: 她的眼睛透过挡风玻璃扫视夜色。

source: Maybe she was getting her bearings, calculating how far out they were.
zh_cn: 或许她在寻找方位，在计算他们离城市有多远。

source: Cows lowed somewhere in the darkness.
zh_cn: 牛在黑暗中的某个地方叫。

source: She said, "I love Rob - "
zh_cn: 她说：“我爱罗比——”

source: "You're a pretty girl. You've been to the rodeo a few times. You'll do all right. But not with him."
zh_cn: “你是个漂亮的女孩，你去过几次牛仔竞技表演会，你会做得很好，但不要和他一起。”

source: The chalky moon was in and out of clouds.
zh_cn: 苍白的月亮钻进云层又出来。

source: A wind buffeted the truck and kicked up the odor of the brackish creek.
zh_cn: 一阵风吹向卡车，吹起咸水河的气味。

source: The girl was picking at her cuticles, which made her look docile.
zh_cn: 女孩用指尖拉扯不齐整的表皮，使她看起来很温顺。

source: "Is there anything I can say here?
zh_cn: “我能在这儿说什么呢？

source: Is there something you're wanting to hear?"
zh_cn: 有什么你想听的？”

source: "You can say you'll quit him," Lambright said. "I'd like to have your word on that subject."
zh_cn: “你可以说你会离开他，”兰布赖特说，“在这件事上我希望得到你的许诺。”

source: "And if I don't, you'll leave me on the side of the road?"
zh_cn: “如果我不，你会把我丢在路边？”

source: "We're just talking. We're sorting out a problem."
zh_cn: “我们只是在谈，我们在解决一个问题。”

source: "Or you'll beat me up and throw me in the creek?"
zh_cn: “或者你会打我一顿，然后把我扔到河里？”

source: "You're too much for him. He's overmatched."
zh_cn: “你比他强，他配不上。”

source: "And so if I don't dump him, you'll, what, rape me? Murder me? Bury me in the dunes?"
zh_cn: “那么如果我不甩了他，你会，怎么做，强奸我？谋杀我？把我埋在沙丘里？”

source: "Lisa," he said, his tone pleasingly superior. He liked how much he sounded like a father.
zh_cn: “丽莎，”他说，他的语调优越并带着愉悦，他喜欢自己听上去很像一个父亲。

source: Another wind blew, stiff and parched, rustling the trees.
zh_cn: 又一阵风吹来，猛烈而炎热，树木沙沙作响。

source: To Lambright, they appeared to shiver, like they'd gotten cold.
zh_cn: 在兰布赖特看来，它们似乎在颤抖，好像得了感冒。

source: A low cloud unspooled on the horizon.
zh_cn: 一朵低低的云在地平线上舒展开来。

source: The cows were quiet.
zh_cn: 牛都安静了。

source: "I see how you look at me, you know," she said, shifting toward him.
zh_cn: “我看得出你是怎么看我的，你也知道的，”她说，同时向他移过来。

source: She unbuckled her seat belt, the noise startlingly loud in the truck.
zh_cn: 她解开安全带，这声音在卡车里惊人地响。

source: Lambright's eyes went to the rearview mirror: no one around.
zh_cn: 兰布赖特看了看后视镜：四周没人。

source: She scooted an inch closer. Two inches. Three.
zh_cn: 她挪过来一英寸、两英寸、三英寸。

source: He smelled lavender, her hair or cool skin.
zh_cn: 他闻到薰衣草的香味，来自她的头发或清凉的皮肤。

source: She said, "Everyone sees it. Nobody'll be surprised you drove me out here."
zh_cn: 她说：“大家都知道，你开车把我带到这里来没人会吃惊的。”

source: "I'm telling you to stay away from my son."
zh_cn: “我是让你离开我儿子。”

source: "In the middle of the night, in the middle of nowhere."
zh_cn: “半夜三更，不知道在什么鬼地方。”

source: "There's no mystery here," Lambright said.
zh_cn: “这里没什么神秘的，”兰布赖特说。

source: "Silly," she said.
zh_cn: “愚蠢，”她说。

source: "I said you're silly.
zh_cn: “我说你愚蠢。

source: There's mystery all around us.
zh_cn: 我们周围到处都有神秘的事。

source: Goats in trees. Macaws in cars."
zh_cn: 树上的山羊，车里的金刚鹦鹉。”

source: Enough, Lambright thought.
zh_cn: 够了，兰布赖特想。

source: He cranked the ignition, switched on his headlights.
zh_cn: 他转动点火装置，打开前灯。

source: "A man who drives his son's underage girl into remote areas, that's awfully mysterious."
zh_cn: “一个开车带他儿子的未成年女友到偏远地区的男人，那可真神秘。”

source: "Just turn him loose," he said.
zh_cn: “和他断绝关系，”他说。

source: "A girl who flees the truck and comes home dirty and crying. What will she tell her parents?
zh_cn: “一个逃出卡车、脏兮兮地哭着回家的女孩，她会跟她父母说呢？

source: Her boyfriend?
zh_cn: 她的男朋友？

source: The man's depressed wife?"
zh_cn: 那个男人沮丧的妻子？”

source: "Just leave him be," he said. "That's the takeaway tonight."
zh_cn: “随他去，”他说，“这就是今晚出来的目的。”

source: "Will the police be called?
zh_cn: “要叫警察吗？

source: Will they match the clay on her shoes to his tires?"
zh_cn: 他们会比对她鞋上和他轮胎上的泥土吗？”

source: "Lisa - "
zh_cn: “丽莎——”

source: "Or will she keep it to herself?
zh_cn: “或者她谁也不告诉？

source: Will it be something she and the man always remember when they see each other?
zh_cn: 这事儿将成为她和那个男人看见对方时永远会想起的事？

source: When she marries his son, when she bears his grandbabies?
zh_cn: 当她嫁给他儿子时，当她生下他孙子时？

source: These are bona fide mysteries, Mr. Lambright."
zh_cn: 这可真够神秘的，兰布赖特先生。”

source: "Lisa," he said. "Lisa, let's be clear."
zh_cn: “丽莎，”他说，“丽莎，让我们说清楚。”

source: But she was already out of the truck, sprinting toward the creek.
zh_cn: 但她已经下了卡车，快速跑向小河。

source: She flashed through the brush and descended the bank, and Lambright was shocked by the languid swiftness with which she crossed the earth.
zh_cn: 她飞快地穿过灌木丛，跑下河堤，兰布赖特被她穿过大地的那种懒洋洋的敏捷震惊了。

source: Blood was surging in his veins, like he'd swerved to miss something in the road and his truck had just skidded to a stop and he didn't yet know if he was hurt, if the world was changed.
zh_cn: 血在他的血管里涌动，好像他突然转向要避开路上的什么东西似的，他的卡车刚刚刹车停下，他还不知道自己是否受伤、世界是否改变了。

source: The passenger door was open, the interior light burning, pooling.
zh_cn: 副驾驶的门是开着的，里面的灯开着。

source: The girl jumped across the creek and bolted alongside it.
zh_cn: 女孩跳过小河，沿着河飞跑。

source: She cut to and fro.
zh_cn: 她来来回回地快速跑。

source: He wanted to see her as an animal he'd managed to avoid, a rare and dangerous creature he'd describe for Robbie when he got home, but really her movement reminded him of a trickle of water tracking through pebbles.
zh_cn: 他想把她看作一只他设法避开的动物，一只当他到家时他要给罗比讲述的罕见而危险的动物，但实际上她的动作让他想起一股穿过鹅卵石的水流。

source: It stirred in him a floating sensation, the curious and scattered feeling of being born on waves or air or wings.
zh_cn: 这在他心中激起一种漂浮的感觉，那种奇怪而零散的在波浪上、空气中或翅膀上出生的感觉。

source: He was disoriented, short of breath.
zh_cn: 他分不清方向，喘不上气。

source: He knew he was at the beginning of something, though just then he couldn't say exactly what.
zh_cn: 他知道他正处在某件事的开端，虽然此刻他不能确切地说那是什么。
